In [106]:
# WE saw python basics, connectivity with databases are api's 
# deployment
# today we are going to study Pandas 
# it is used in statistics , ML, in industry we will also use pandas 
# we will study basic reading  and data frame 
# we will study pandas in details

In [107]:
pip install pandas

Requirement already satisfied: pandas in /home/gitpod/.pyenv/versions/3.12.0/lib/python3.12/site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.26.0 in /home/gitpod/.pyenv/versions/3.12.0/lib/python3.12/site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/gitpod/.pyenv/versions/3.12.0/lib/python3.12/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/gitpod/.pyenv/versions/3.12.0/lib/python3.12/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /home/gitpod/.pyenv/versions/3.12.0/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/gitpod/.pyenv/versions/3.12.0/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.3 -> 23.3.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [108]:
import pandas as pd

In [109]:
# how to read files, csv,...etc

In [110]:
# i have atlantis.csv is 
# how to red csv files 
pd.read_csv('atlantis.csv')

    year  population
0   2000       12400
1   2001       12800
2   2002       13800
3   2003       13600
4   2004       14200
5   2005       15600
6   2006       17600
7   2007       19200
8   2008       20300
9   2009       20800
10  2010       21200
11  2011       22400
12  2012       23400
13  2013       24500
14  2014       25800
15  2015       26100
16  2016       28300
17  2017       29600
18  2018       32100
19  2019       32500
20  2020       33200
21  2021       33800

In [111]:
# pandas read structured dta, tabular format, or excel sheeet are read  by pandas

In [112]:
df = pd.read_csv('atlantis.csv')

In [113]:
df.head() # first five or first three records

   year  population
0  2000       12400
1  2001       12800
2  2002       13800
3  2003       13600
4  2004       14200

In [114]:
# whenever pandas read data frame the first row is read as column name

In [115]:
df = pd.read_csv("atlantis.csv")

In [116]:
df.tail() # last five records

    year  population
17  2017       29600
18  2018       32100
19  2019       32500
20  2020       33200
21  2021       33800

In [117]:
df.tail(3) # last three records

    year  population
19  2019       32500
20  2020       33200
21  2021       33800

In [118]:
type(df) # it is a data frame - data frame is a tabular structure

pandas.core.frame.DataFrame

In [119]:
df.columns

Index(['year', 'population'], dtype='object')

In [120]:
list(df.columns)

['year', 'population']

In [121]:
df['year'] # selecting a single column

0     2000
1     2001
2     2002
3     2003
4     2004
5     2005
6     2006
7     2007
8     2008
9     2009
10    2010
11    2011
12    2012
13    2013
14    2014
15    2015
16    2016
17    2017
18    2018
19    2019
20    2020
21    2021
Name: year, dtype: int64

In [122]:
type(df['year']) # series is a equivalent to list ,indexes are also showing in series

pandas.core.series.Series

In [123]:
df[['year']]

    year
0   2000
1   2001
2   2002
3   2003
4   2004
5   2005
6   2006
7   2007
8   2008
9   2009
10  2010
11  2011
12  2012
13  2013
14  2014
15  2015
16  2016
17  2017
18  2018
19  2019
20  2020
21  2021

In [124]:
type(df[['year']]) # this is as data frame

pandas.core.frame.DataFrame

In [125]:
# df['year','something'] # error not a syntax

In [126]:
df[['year','population']] #selecting multiple columns

    year  population
0   2000       12400
1   2001       12800
2   2002       13800
3   2003       13600
4   2004       14200
5   2005       15600
6   2006       17600
7   2007       19200
8   2008       20300
9   2009       20800
10  2010       21200
11  2011       22400
12  2012       23400
13  2013       24500
14  2014       25800
15  2015       26100
16  2016       28300
17  2017       29600
18  2018       32100
19  2019       32500
20  2020       33200
21  2021       33800

In [127]:
df.dtypes

year          int64
population    int64
dtype: object

In [128]:
# reading excel fiile
df1 = pd.read_excel("student.xlsx")

In [129]:
df1.dtypes

id         int64
name      object
class     object
mark       int64
gender    object
dtype: object

In [130]:
df1.columns

Index(['id', 'name', 'class', 'mark', 'gender'], dtype='object')

In [131]:
df1[['name',"class"]]

           name  class
0      John Deo   Four
1      Max Ruin  Three
2        Arnold  Three
3    Krish Star   Four
4     John Mike   Four
5     Alex John   Four
6   My John Rob   Five
7        Asruid   Five
8       Tes Qry    Six
9      Big John   Four
10       Ronald    Six
11        Recky    Six
12          Kty  Seven
13         Bigy  Seven
14     Tade Row   Four
15        Gimmy   Four
16        Tumyu    Six
17        Honny   Five
18        Tinny   Nine
19       Jackly   Nine
20   Babby John   Four
21       Reggid  Seven
22        Herod  Eight
23    Tiddy Now  Seven
24     Giff Tow    Six
25       Crelea  Seven
26     Big Nose  Three
27    Rojj Base  Seven
28  Tess Played  Seven
29    Reppy Red    Six
30  Marry Toeey   Four
31    Binn Rott  Seven
32    Kenn Rein    Six
33     Gain Toe  Seven
34   Rows Noump    Six

In [132]:
# reading from internet
# pd.read_csv("pass the link here") # ... will be read

In [133]:
# retreiving data from website
df3 = pd.read_html('https://www.basketball-reference.com/players/r/')

In [136]:
type(df3) # table can be multiple so it returns a list

list

In [138]:
len(df3)

1

In [139]:
df3 = df3[0]

In [141]:
type(df3) # now this will be a dataframe

pandas.core.frame.DataFrame

In [142]:
df3.columns

Index(['Player', 'From', 'To', 'Pos', 'Ht', 'Wt', 'Birth Date', 'Colleges'], dtype='object')

In [143]:
df3.dtypes

Player        object
From           int64
To             int64
Pos           object
Ht            object
Wt             int64
Birth Date    object
Colleges      object
dtype: object

In [147]:
# storing data in some file
df3.to_csv("players_data.csv",index=False) # index will not be stored